{
  "title": "Tardis-Connector",
  "start_date": "2025/03/17",
  "end_date": "2025/03/21",
  "desc": [
    "The TARDIS Connector Workshop 2025 is a collaborative event dedicated to advancing our understanding of stripped-envelope supernovae by leveraging the expertise and tools of the open science astrophysics community. This workshop will bring together specialists in atomic physics, stellar evolution, hydrodynamics, and radiative transport to develop workflows that connect stellar evolution models to synthetic observables."
  ],
  "time": "9:00",
  "location": "12th Floor, Flatiron Institute, 162 5th Avenue, New York, NY 10010",
  "extra_info": {
    "title": "What are we trying to achieve?",
    "desc": [
      "This workshop offers a unique opportunity for collaborative problem-solving rather than traditional presentations. Developers and contributors across different software teams (MESA, Flash-X, STELLA, and TARDIS) will work together to tackle the interfaces between the codes. Our aim is to produce a comprehensive model framework and reproducible recipes to address the physics needed for stripped-envelope supernovae simulation."
    ]
  },
  "panels": [
    {
      "title": "MESA",
      "url": "https://docs.mesastar.org/en/24.08.1/",
      "intro": "MESA is a powerful and versatile open-source software suite built to allow users to run experiments in stellar evolution. Stellar evolution calculations are a basic tool that enable a broad range of research in various astrophysics areas such as asteroseismology, nuclear astrophysics, stellar populations, chemical evolution and population synthesis etc.",
      "logo": "assets/images/mesa.png"
    },
    {
      "title": "FLASH-X",
      "url": "https://flash-x.org/",
      "intro": "Flash-X, is a highly composable multiphysics software system that can be used to simulate physical phenomena in several scientific domains. It can simulates core collapse supernovae by modeling the fluid dynamics, nuclear reactions, and neutrino transport during the collapse and explosion.",
      "logo": "assets/images/flash-x.png"
    },
    {
      "title": "STELLA",
      "url": "https://github.com/sblinnikov/OpenStella",
      "intro": "STELLA is a one-dimensional code used to simulate how light interacts with matter during stellar explosions like supernovae. It combines physics of motion (hydrodynamics) and radiation to create models of how supernovae properties evolve over time. The public version of STELLA is integrated with MESA.",
      "logo": "assets/images/stella.png"
    },
    {
      "title": "TARDIS",
      "url": "https://tardis-sn.github.io/",
      "intro": "TARDIS is an open-source Monte Carlo radiative-transfer spectral synthesis code for 1D models of supernova ejecta. It is designed for rapid spectral modelling of supernovae. It provides several tools for physics calculation and visualization to make your supernova research easier.",
      "logo": "assets/images/tardis-logo-2.svg"
    }
  ],
  "soc": [
    {
      "name": "Matteo Cantiello",
      "imageSource": "assets/images/soc/matteo.png",
      "institution": "Center for Computational Astrophysics, Flatiron Institute"
    },
    {
      "name": "Sean Couch",
      "imageSource": "assets/images/soc/couch-sean-cropped.jpg",
      "institution": "Michigan State University"
    },
    {
      "name": "Jared Goldberg",
      "imageSource": "assets/images/soc/jared.png",
      "institution": "Center for Computational Astrophysics, Flatiron Institute"
    },
    {
      "name": "Wolfgang Kerzendorf",
      "imageSource": "assets/images/soc/wolfgang.jpg",
      "institution": "Michigan State University"
    },
    {
      "name": "Jing Lu",
      "imageSource": "assets/images/soc/jing.jpg",
      "institution": "Michigan State University"
    },
    {
      "name": "Brian Metzger",
      "imageSource": "assets/images/soc/bmetzger.jpg",
      "institution": "Center for Computational Astrophysics, Flatiron Institute"
    }
  ]
}
